wolfSSL/wolftpm-examples/Infineon/PSoC6_WiFi_HTTPS_Server/source/secure_http_server.c
/******************************************************************************
* File Name: secure_http_server.c
*
* Description: This file contains the necessary functions to start the HTTPS
* server and processes GET, POST, and PUT request from the HTTPS client.
*
* Related Document: See README.md
*******************************************************************************
* Copyright 2020-2023, Cypress Semiconductor Corporation (an Infineon company) or
* an affiliate of Cypress Semiconductor Corporation.  All rights reserved.
*
* This software, including source code, documentation and related
* materials ("Software") is owned by Cypress Semiconductor Corporation
* or one of its affiliates ("Cypress") and is protected by and subject to
* worldwide patent protection (United States and foreign),
* United States copyright laws and international treaty provisions.
* Therefore, you may use this Software only as provided in the license
* agreement accompanying the software package from which you
* obtained this Software ("EULA").
* If no EULA applies, Cypress hereby grants you a personal, non-exclusive,
* non-transferable license to copy, modify, and compile the Software
* source code solely for use in connection with Cypress's
* integrated circuit products.  Any reproduction, modification, translation,
* compilation, or representation of this Software except as specified
* above is prohibited without the express written permission of Cypress.
*
* Disclaimer: THIS SOFTWARE IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND,
* EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, NONINFRINGEMENT, IMPLIED
* WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. Cypress
* reserves the right to make changes to the Software without notice. Cypress
* does not assume any liability arising out of the application or use of the
* Software or any product or circuit described in the Software. Cypress does
* not authorize its products for use in any products where a malfunction or
* failure of the Cypress product may reasonably be expected to result in
* significant property damage, injury or death ("High Risk Product"). By
* including Cypress's product in a High Risk Product, the manufacturer
* of such system or application assumes all risk of such use and in doing
* so agrees to indemnify Cypress against all liability.
*******************************************************************************/

/* Header file includes */
#include "cyhal.h"
#include "cybsp.h"
#include "cy_retarget_io.h"

/* FreeRTOS header file */
#include <FreeRTOS.h>
#include <task.h>
#include <semphr.h>

/* Cypress Secure Sockets header file */
#include "cy_secure_sockets.h"
#include "cy_tls.h"

/* Wi-Fi connection manager header files */
#include "cy_wcm.h"
#include "cy_wcm_error.h"

/* Standard C header file */
 #define _GNU_SOURCE
#include <string.h>
extern void *memmem(const void* haystack, size_t haystacklen,
                    const void* needle, size_t needlelen);

/* HTTPS server task header file. */
#include "secure_http_server.h"
#include "cy_http_server.h"
#include "secure_keys.h"

/* MDNS responder header file */
#include "mdns.h"

/* TPM */
#include <wolftpm/tpm2_wrap.h>
extern WOLFTPM2_DEV mDev;

/*******************************************************************************
* Global Variables
********************************************************************************/
/* Holds the IP address obtained using Wi-Fi Connection Manager (WCM). */
static cy_wcm_ip_address_t ip_addr;

/* Secure HTTP server instance. */
static cy_http_server_t https_server;

/* Wi-Fi network interface. */
static cy_network_interface_t nw_interface;

/* Holds the IP address and port number details of the socket for the HTTPS server. */
static cy_socket_sockaddr_t https_ip_address;

#ifdef HTTPS_PORT
/* Holds the security configuration such as server certificate,
 * server key, and rootCA.
 */
static cy_https_server_security_info_t security_config;
#endif

/* Holds the response handler for HTTPS GET and POST request from the client. */
static cy_resource_dynamic_data_t https_get_post_resource;

/* Holds the user data which adds/updates the URL data resources. */
static cy_resource_dynamic_data_t https_put_resource;

/* Global variable to track number of resources registered. */
static uint32_t number_of_resources_registered = 0;

/* Holds all the URL resources along with its data. */
typedef struct
{
    char *resource_name;
    char *value;
    uint32_t length;
} https_url_database_t;

/* Initializes the URL database with first entry reserved for HTTPS root URL.
 * The default value of MAX_NUMBER_OF_HTTP_SERVER_RESOURCES is 10 as defined
 * by the HTTPS server middleware. This can be overriden by setting its value
 * in the application Makefile. Refer to README.md for details.
 */
static https_url_database_t url_resources_db[MAX_NUMBER_OF_HTTP_SERVER_RESOURCES] =
{
    /* First entry in the URL database is reserved for HTTPS Root URL. */
    { (char *)"/", NULL, 0 }
};


#define MAX_FIRMWARE_MANIFEST_SZ 4096

#ifndef HTTP_SERVER_MTU_SIZE
#define HTTP_SERVER_MTU_SIZE             (1460)
#endif

#define FW_UPDATE_TASK_STACK_SIZE        (5 * 1024)
#define FW_UPDATE_TASK_PRIORITY          (1)

#define IFX_FW_MAX_CHUNK_SZ 1024

static TaskHandle_t fw_update_task_handle = NULL;

typedef struct FirmwareChunk {
    uint32_t sz;
    uint8_t  buf[IFX_FW_MAX_CHUNK_SZ];
} FirmwareChunk_t;

typedef enum {
    FW_STATE_INIT,
    FW_STATE_MANIFEST_START,
    FW_STATE_MANIFEST_DONE,
    FW_STATE_FIRMWARE_DATA_START,
    FW_STATE_FIRMWARE_DATA_CHUNK,
    FW_STATE_FIRMWARE_DONE,
    FW_STATE_FIRMWARE_REST
} FwState;

typedef enum {
    FW_STATE_THREAD_INIT,
    FW_STATE_THREAD_STARTED,
    FW_STATE_THREAD_READY,
    FW_STATE_THREAD_DONE,
    FW_STATE_THREAD_FAILED
} FwThreadState;

typedef struct {
    FwState state;
    FwThreadState threadState;
    int           threadRc;
    TaskHandle_t  notifyHandle;
    uint8_t manifest[MAX_FIRMWARE_MANIFEST_SZ];
    size_t  manifestSz;
    size_t  firmwareSz;
    FirmwareChunk_t chunk;

    char boundary[64];
    char fieldName[64];
    char fileName[64];
} fw_info_t;
