wolfSSL/wolftpm-examples/Infineon/PSoC6_WiFi_HTTPS_Server/source/secure_http_server.c
static fw_info_t mFwInfo;


/******************************************************************************
* Function Prototypes
*******************************************************************************/
static cy_rslt_t configure_https_server(void);
void print_heap_usage(char *msg);
extern const char* TPM2_IFX_GetInfo(int* opMode);
extern int TPM2_IFX_Init(void);


/* Company Logo */
#define INFINEON_LOGO \
    "<img style=\"float: right;\" alt=\"logo.png\" "\
    "src=\"data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAATkAAABcBAMAAADngd+fAA" \
           "AAD1BMVEX///8VWJbiOlVtkLHIxNm177myAAAEAklEQVR4AezBgQAAAACAoP2pF6kCA" \
           "ABmxgxw29VhMO4WHwArHABlOQBpOIAJvv+ZnmPolnbbwn9Dev2EPNJK3m+fHZPRlmRf" \
           "JMKvh7aRwSvKXAsMryg0NnhFdcmKyvCSIupf1DgVErnzjJMkp8KJ0p2WLJJqhtPkR6L" \
           "hPfvfPOxIdSZe9iHS9JGdV/5Lj+xiOEVX7z2851qIkHr4rRbadFqrKNz4sYpOkAY4qD" \
           "XNX1unmk6zDtM7nZLR9Fu6hehU89CGcEc1HcJhurdHOqrFp1gXoKL7sqp80LuObPNHR" \
           "0V9NQHQgsZ6MohmbnYdG10XOxr0xiVIvV6JGGAx2LKjMUp0LbqF9nXcS4tEk+aO/aI3" \
           "EPdA5dcwLORwbhYWNjpSleiAesvRW5OzfQP4ZaOvt4f0kRKY5iIquEpAQJPeKKSuNjr" \
           "LrmGeWoUdKzrWON/pBriQUF8cUS6rVcM7EqlWUrp4VZSZeHErcVkxDSJIcxw6DY3RlS" \
           "u6qSPWfGB0rlyLK2vSq99iw7tHYdn9SJqIYOn1Pk5ArAGQ4OI6/XRoth3c6RgrumFHW" \
           "4Z9qfa1vENhqNT1G91C7hMdd4Xucozu8kHXP9E5pOkrOkxpnW+3Oa1p5R2HXA27FiIQ" \
           "TT5A3Ohwo7PJgJbuD96RaqNzn+lu6e2W0k1/vFUDZVLsaaMnoysf9+pdAbMudPr9Qlz" \
           "2EP8zXX+ULhU85dPr3TvTYMs4CG90qLHes7rEYl6n4U/eORH5wbtk3qW3is7U0YQidz" \
           "ogLnRDAes1p5tA1xYODONvvTNU+IYOtO20qKkInuimZLbvfWd0pSPjFDWzAVsu1NCiG" \
           "3/cs6qDe7aic3C50yFtdD0UusXy2EQZOge6bM278L13eiHf593UnHdIpr2IVDx/ors4" \
           "8647Nu/s/PS9dxcb55FWmo54B7RrMhct21LT9epX9ayQOLQPUOO3dLg/z4jgEF2kTfv" \
           "N9pyt6dC+stCDudtsvHCn657oLDvrmmZoVbY+fA5I1RmlriwSG123obsjR2OGbyWsAe" \
           "Xw+c7ES32++1JoyaEpr4J/kDTPxhOg6az/K0Y4rEczuvRIt9JjtbIwewx5CygIeQyIE" \
           "vLoOaCwHDHvMB6OT5V9Si8fAlXAEHzmMAbPOWD2cMV8zXqFEHL2oxwxz/NBuAA/a42b" \
           "Ukyg8tkrXQjjqDBidNd89Uo3+qx0DE3lw3jY7FBMd7GlDlLolEV8HtU29c5flVKCmoq" \
           "Z4Tw8+1sP4vHZ72SbxhlcG68UVgBOxWvZlw8PHhGBc3X1JvneNx/+75faX79zx/wC75" \
           "SNwRSC4MYlcv/I1i/C96QALyH8ClDgdYTy4Jr81x4cEwAAACAMsn9qM+wHlgEAAADAA" \
           "To83zvHyP+JAAAAAElFTkSuQmCC\" />"

#define HTTPS_STARTUP_HEADER \
"<!DOCTYPE html>" \
"<html>" \
"<head>" \
"<title>Infineon TPM Firmware Update Demo</title>" \
"</head>" \
"<body>" \
"<h1 style=\"text-align: left\">Infineon TPM Firmware Update Demo" \
INFINEON_LOGO \
"</h1>" \
"<p><span style=\"font-size: 12pt;\"><strong>Infineon</strong> is the first TPM vendor to <strong>open source their " \
"firmware update procedure and process</strong> in their latest <strong>Infineon SLB9672 (SPI) and SLB9673 (I2C)</strong> versions of the TPM 2.0 module.</span></p>" \
"<p><span style=\"font-size: 12pt;\"><strong>wolfTPM</strong> is the only library to offer integrated support for updating TPM firmware.</span></p>" \
"<p><span style=\"text-decoration: underline;\"><span style=\"font-size: 12pt;\">Demo Platform:</span></span></p>" \
"<ul>" \
"    <li><span style=\"font-size: 12pt;\">Infineon PSoC 62S2 evaluation kit (Wifi)</span></li>" \
"    <li><span style=\"font-size: 12pt;\">Infineon SLB9373 (I2C) TPM 2.0 mikroBUS module</span></li>" \
"    <li><span style=\"font-size: 12pt;\">Modus Toolbox Wi-Fi-HTTPS-Server demo</span>" \
"    <ul>" \
"        <li><span style=\"font-size: 12pt;\">wolfSSL TLS v1.3 server</span></li>" \
"        <li><span style=\"font-size: 12pt;\">wolfTPM</span></li>" \
"    </ul>" \
"    </li>" \
"</ul>" \
"<h2>TPM Module Interface</h2>" \
"<form method=\"get\">" \
"<fieldset>" \
"    <legend>Firmware Status</legend>" \
"    <input type=\"submit\" value=\"Refresh TPM\"/>" \
"    <textarea id=\"tpm_status\" name=\"tpm_status\" rows=\"4\" cols=\"60\">"

#define HTTPS_STARTUP_FOOTER \
"    </textarea>" \
"</fieldset>" \
"</form>" \
"<form method=\"post\" enctype=\"multipart/form-data\">" \
"<fieldset>" \
"    <legend>Firmware Update</legend>" \
"    <p>" \
"        <label for=\"manifest\">Manifest File:</label>" \
"        <input type=\"file\" name=\"manifest\" value=\"Manifest File\"/></br></br>" \
"    </p>" \
"    <p>" \
"        <label for=\"data\">Firmware File:</label>" \
"        <input type=\"file\" name=\"data\" value=\"Firmware File\"/>" \
"    </p>" \
"    <input type=\"submit\" name=\"submit\" value=\"Update Firmware\"/>" \
"</fieldset>" \
"</form>" \
"</body>" \
"</html>"

//#define TEST_MODE

/* Local Functions */
static int TPM2_IFX_FwData_Cb(uint8_t* data, uint32_t data_req_sz,
    uint32_t offset, void* cb_ctx)
{
    fw_info_t* fwInfo = (fw_info_t*)cb_ctx;
    FirmwareChunk_t* fwChunk = NULL;

    fwInfo->threadState = FW_STATE_THREAD_READY;

#ifdef TEST_MODE
    do {
#endif

    /* wait for chunk */
    ulTaskNotifyTake(pdTRUE, portMAX_DELAY);
    fwChunk = &fwInfo->chunk;

    /* Process chunks */
    if (data_req_sz > fwChunk->sz) {
        data_req_sz = fwChunk->sz;
    }
    if (data_req_sz > 0) {
        XMEMCPY(data, fwChunk->buf, data_req_sz);
        fwInfo->firmwareSz += data_req_sz;
    }

#if 0
    printf("Chunk %d (total %d)\r\n", (int)fwChunk->sz, fwInfo->firmwareSz);
#endif

    xTaskNotifyGive(fwInfo->notifyHandle);

#ifdef TEST_MODE
    } while (fwChunk->sz > 0);
#endif

    return data_req_sz;
}

static void fw_update_task(void *arg)
{
    int rc;
    int opMode = 0, recovery = 0;
    fw_info_t* fwInfo = (fw_info_t*)arg;
    (void)TPM2_IFX_GetInfo(&opMode);
    if (opMode == 0x02 || (opMode & 0x80)) {
        /* if opmode == 2 or 0x8x then we need to use recovery mode */
        recovery = 1;
    }

    /* task has started */
    fwInfo->threadState = FW_STATE_THREAD_STARTED;
    fwInfo->threadRc = 0;

    /* start the update process */
    if (recovery) {
        printf("Firmware Update (recovery mode):\n");
        rc = wolfTPM2_FirmwareUpgradeRecover(&mDev,
            fwInfo->manifest, fwInfo->manifestSz,
            TPM2_IFX_FwData_Cb, fwInfo);
    }
    else {
        printf("Firmware Update (normal mode):\n");
        rc = wolfTPM2_FirmwareUpgrade(&mDev,
            fwInfo->manifest, fwInfo->manifestSz,
            TPM2_IFX_FwData_Cb, fwInfo);
    }
    if (rc != 0) {
        printf("Infineon firmware update failed 0x%x: %s\n",
            rc, TPM2_GetRCString(rc));
        /* task failed */
        fwInfo->threadState = FW_STATE_THREAD_FAILED;
        fwInfo->threadRc = rc;
    }
    else {
        printf("Infineon firmware update success!\n");
        fwInfo->threadState = FW_STATE_THREAD_DONE;
        fwInfo->threadRc = rc;
    }

    vTaskDelete(NULL); /* done with task */
    fw_update_task_handle = NULL;
}

