wolfSSL/wolftpm-examples/Infineon/PSoC6_WiFi_HTTPS_Server/source/secure_http_server.c
static char* parse_http_multipart_post(const char* header, char* boundary, char* fieldName, char* fileName)
{
    char* found = NULL, *start, *end = NULL;
    size_t sz;
    const char* boundaryStr = "------WebKitFormBoundary";
    const char* contentDisp = "Content-Disposition: form-data;";
    const char* nameStr = "name=\"";
    const char* filenameStr = "filename=\"";
    /* Content-Type: application/octet-stream */
    /* Content-Type: application/x-ms-manifest */
    const char* streamStr = "\r\n\r\n";

    /* get boundary */
    start = strstr(header, boundaryStr);
    if (start != NULL) {
        end = strstr(start, "\r\n");
        if (end != NULL) {
            sz = end-start;
            if (sz > 64-1)
                sz = 64-1;
            memcpy(boundary, start, sz);
            boundary[sz] = '\0'; /* null term */
        }
    }

    if (end != NULL) {
        /* find Content-Disposition */
        start = strstr(end, contentDisp);
        if (start != NULL) {
            start += strlen(contentDisp);
            /* find name=" " */
            start = strstr(start, nameStr);
            if (start != NULL) {
                start += strlen(nameStr);
                end = strstr(start, "\"");
                if (end != NULL) {
                    sz = end-start;
                    if (sz > 64-1)
                        sz = 64-1;
                    memcpy(fieldName, start, sz);
                    fieldName[sz] = '\0'; /* null term */
                }
            }
        }
    }

    if (end != NULL) {
        /* find filename */
        start = strstr(end, filenameStr);
        if (start != NULL) {
            start += strlen(filenameStr);
            end = strstr(start, "\"");
            if (end != NULL) {
                sz = end-start;
                if (sz > 64-1)
                    sz = 64-1;
                memcpy(fileName, start, sz);
                fileName[sz] = '\0'; /* null term */
            }
        }
    }

    if (end != NULL) {
        /* locate start of data stream and return pointer to it */
        found = strstr(end, streamStr);
        if (found != NULL) {
            found += strlen(streamStr);
        }
    }
    return found;
}

/*******************************************************************************
 * Function Name: dynamic_resource_handler
 *******************************************************************************
 * Summary:
 *  Handles HTTPS GET, POST, and PUT requests from the client.
 *  HTTPS GET sends the current CYBSP_USER_LED status as a response to the client.
 *  HTTPS POST toggles the CYBSP_USER_LED and then sends its current state as a
 *  response to the client.
 *  HTTPS PUT sends an error message as a response to the client if the resource
 *  registration is unsuccessful.
 *
 * Parameters:
 *  url_path - Pointer to the HTTPS URL path.
 *  url_parameters - Pointer to the HTTPS URL query string.
 *  stream - Pointer to the HTTPS response stream.
 *  arg - Pointer to the argument passed during HTTPS resource registration.
 *  https_message_body - Pointer to the HTTPS data from the client.
 *
 * Return:
 *  int32_t - Returns HTTPS_REQUEST_HANDLE_SUCCESS if the request from the client
 *  was handled successfully. Otherwise, it returns HTTPS_REQUEST_HANDLE_ERROR.
 *
 *******************************************************************************/
int32_t dynamic_resource_handler(const char* url_path,
                                 const char* url_parameters,
                                 cy_http_response_stream_t* stream,
                                 void* arg,
                                 cy_http_message_body_t* https_message_body)
{
    cy_rslt_t result = CY_RSLT_SUCCESS;
    int32_t status = HTTPS_REQUEST_HANDLE_SUCCESS;
    char err_buf[MAX_STATUS_LENGTH];
    const char* msg;
    size_t offset = 0;

    err_buf[0] = '\0'; /* empty string */
    cyhal_gpio_write(CYBSP_USER_LED, CYBSP_LED_STATE_ON);

    switch (https_message_body->request_type)
    {
        case CY_HTTP_REQUEST_GET:
            APP_INFO(("Received HTTPS GET request.\n"));

            /* Send the HTTPS response. */
            msg = HTTPS_STARTUP_HEADER;
            result = cy_http_server_response_stream_write_payload(stream,
                msg, strlen(msg));
            if (CY_RSLT_SUCCESS == result) {
                msg = TPM2_IFX_GetInfo(NULL);
                result = cy_http_server_response_stream_write_payload(stream,
                    msg, strlen(msg));
            }
            if (CY_RSLT_SUCCESS == result) {
                msg = HTTPS_STARTUP_FOOTER;
                result = cy_http_server_response_stream_write_payload(stream,
                    msg, strlen(msg));
            }
            if (CY_RSLT_SUCCESS != result) {
                ERR_INFO(("Failed to send the HTTPS GET response.\n"));
            }
            break;

        case CY_HTTP_REQUEST_POST:
            APP_INFO(("Received HTTPS POST request.\n"));

        #if 0
            printf("https_message_body->data_length %d, remain %lu\r\n",
                https_message_body->data_length,
                https_message_body->data_remaining
            );
            #if 0
            if (mFwInfo.state == FW_STATE_INIT && https_message_body->data_length > 0) {
                int i;
                printf("HTTP Data:\r\n");
                for (i=0; i<https_message_body->data_length; i++) {
                    printf("%02x ", https_message_body->data[i]);
                }
                printf("\r\n");
            }
            #endif
        #endif

            /* State Machine */
            switch (mFwInfo.state) {
                case FW_STATE_INIT:
                    cyhal_gpio_write(CYBSP_USER_LED2, CYBSP_LED_STATE_ON);

                    /* parser manifest file */
                    memset(&mFwInfo, 0, sizeof(mFwInfo));
                    msg = parse_http_multipart_post((char*)https_message_body->data,
                        mFwInfo.boundary, mFwInfo.fieldName, mFwInfo.fileName);
                    if (msg != NULL) {
                        printf("POST: Field: %s, File %s, Boundary %s\n",
                            mFwInfo.fieldName, mFwInfo.fileName, mFwInfo.boundary);
                        if (strcmp(mFwInfo.fieldName, "manifest") == 0) {
                            offset = msg - (char*)https_message_body->data;
                            if (offset > https_message_body->data_length)
                                offset = https_message_body->data_length;
                            mFwInfo.manifestSz = https_message_body->data_length - offset;
                            if (mFwInfo.manifestSz > sizeof(mFwInfo.manifest))
                                mFwInfo.manifestSz = sizeof(mFwInfo.manifest);
                            memcpy(mFwInfo.manifest, msg, mFwInfo.manifestSz);
                            mFwInfo.state = FW_STATE_MANIFEST_START;
                            break;
                        }
                    }

                    snprintf(err_buf, sizeof(err_buf),
                        "POST manifest failed! Field: %s, File %s, Boundary %s\r\n",
                        mFwInfo.fieldName, mFwInfo.fileName, mFwInfo.boundary);
                    puts(err_buf);
                    result = cy_http_server_response_stream_write_payload(stream, err_buf, strlen(err_buf));
                    mFwInfo.state = FW_STATE_INIT;
                    return HTTPS_REQUEST_HANDLE_ERROR;

                case FW_STATE_MANIFEST_START:
                    /* find end of boundary */
                    msg = memmem(https_message_body->data, https_message_body->data_length,
                        mFwInfo.boundary, strlen(mFwInfo.boundary));
                    if (msg != NULL) {
                        /* found end of stream */
                        msg -= 2; /* backup \r\n */
                        offset = msg - (char*)https_message_body->data;
                        if (offset > https_message_body->data_length)
                            offset = https_message_body->data_length;
                        if (mFwInfo.manifestSz + offset < sizeof(mFwInfo.manifest)) {
                            memcpy(&mFwInfo.manifest[mFwInfo.manifestSz], https_message_body->data, offset);
                            mFwInfo.manifestSz += offset;

                            /* advance state and fall though state machine below */
                            mFwInfo.state = FW_STATE_MANIFEST_DONE;
                        }
                        else {
                            snprintf(err_buf, sizeof(err_buf),
                                "POST manifest end overrun! Manifest Sz %d, offset %d\r\n",
                                mFwInfo.manifestSz, offset);
                            puts(err_buf);
                            result = cy_http_server_response_stream_write_payload(stream, err_buf, strlen(err_buf));
                            mFwInfo.state = FW_STATE_INIT;
                            return HTTPS_REQUEST_HANDLE_ERROR;
                        }
                    }
                    else {
                        /* copy all data */
                        if (mFwInfo.manifestSz + https_message_body->data_length < sizeof(mFwInfo.manifest)) {
                            memcpy(&mFwInfo.manifest[mFwInfo.manifestSz], https_message_body->data, https_message_body->data_length);
                            mFwInfo.manifestSz += https_message_body->data_length;
                        }
                        else {
                            snprintf(err_buf, sizeof(err_buf),
                                "POST manifest middle overrun! Manifest Sz %d, Data %d\r\n",
                                mFwInfo.manifestSz, https_message_body->data_length);
                            puts(err_buf);
                            result = cy_http_server_response_stream_write_payload(stream, err_buf, strlen(err_buf));
                            mFwInfo.state = FW_STATE_INIT;
                            return HTTPS_REQUEST_HANDLE_ERROR;
                        }
                        break;
                    }
                    /* fall-through */

