wolfSSL/wolftpm-examples/Infineon/PSoC6_WiFi_HTTPS_Server/source/secure_http_server.c
                case FW_STATE_MANIFEST_DONE:
                    printf("Manifest data received: %d bytes\r\n", mFwInfo.manifestSz);

                    /* get the current thread for fw data notifications */
                    mFwInfo.notifyHandle = xTaskGetCurrentTaskHandle();

                    /* start thread */
                    printf("Starting firmware update task\r\n");
                    xTaskCreate(fw_update_task, "FW Update", FW_UPDATE_TASK_STACK_SIZE,
                        &mFwInfo, FW_UPDATE_TASK_PRIORITY, &fw_update_task_handle);
                    /* wait for task to mark state as "ready" */
                    while (mFwInfo.threadState != FW_STATE_THREAD_READY &&
                           mFwInfo.threadState != FW_STATE_THREAD_FAILED) {
                        vTaskDelay(1);
                    }
                    if (mFwInfo.threadState != FW_STATE_THREAD_READY) {
                        snprintf(err_buf, sizeof(err_buf), "Update failed 0x%x: %s",
                            mFwInfo.threadRc, TPM2_GetRCString(mFwInfo.threadRc));
                        puts(err_buf);
                        result = cy_http_server_response_stream_write_payload(stream, err_buf, strlen(err_buf));
                        mFwInfo.state = FW_STATE_INIT;
                        return HTTPS_REQUEST_HANDLE_ERROR;
                    }

                    mFwInfo.state = FW_STATE_FIRMWARE_DATA_START;
                    /* fall-through */

                case FW_STATE_FIRMWARE_DATA_START:
                    /* parse for firmware file */
                    memset(mFwInfo.boundary, 0, sizeof(mFwInfo.boundary));
                    memset(mFwInfo.fieldName, 0, sizeof(mFwInfo.fieldName));
                    memset(mFwInfo.fileName, 0, sizeof(mFwInfo.fileName));
                    msg = parse_http_multipart_post((char*)&https_message_body->data[offset],
                        mFwInfo.boundary, mFwInfo.fieldName, mFwInfo.fileName);
                    if (msg != NULL) {
                        printf("POST: Field: %s, File %s, Boundary %s\n",
                            mFwInfo.fieldName, mFwInfo.fileName, mFwInfo.boundary);
                        if (strcmp(mFwInfo.fieldName, "data") == 0) {
                            /* copy start of firmware data info first chunk */
                            offset = (size_t)msg - (size_t)https_message_body->data;
                            mFwInfo.chunk.sz = https_message_body->data_length - offset;
                            if (mFwInfo.chunk.sz > sizeof(mFwInfo.chunk.buf)) {
                                mFwInfo.chunk.sz = sizeof(mFwInfo.chunk.buf);
                                memcpy(mFwInfo.chunk.buf, &https_message_body->data[offset], mFwInfo.chunk.sz);
                                if (mFwInfo.chunk.sz == sizeof(mFwInfo.chunk.buf)) {
                                    xTaskNotifyGive(fw_update_task_handle);
                                    ulTaskNotifyTake(pdTRUE, portMAX_DELAY);
                                    offset += mFwInfo.chunk.sz;
                                }
                                /* copy any remainder */
                                mFwInfo.chunk.sz = https_message_body->data_length - offset;
                                memcpy(mFwInfo.chunk.buf, &https_message_body->data[offset], mFwInfo.chunk.sz);
                            }
                            mFwInfo.state = FW_STATE_FIRMWARE_DATA_CHUNK;
                            break;
                        }
                    }

                    snprintf(err_buf, sizeof(err_buf),
                        "POST firmware data failed! Field: %s, File %s, Boundary %s\r\n",
                        mFwInfo.fieldName, mFwInfo.fileName, mFwInfo.boundary);
                    puts(err_buf);
                    result = cy_http_server_response_stream_write_payload(stream, err_buf, strlen(err_buf));
                    mFwInfo.state = FW_STATE_INIT;
                    return HTTPS_REQUEST_HANDLE_ERROR;

                case FW_STATE_FIRMWARE_DATA_CHUNK:
                    /* firmware data */
                    /* try and fill chunk */
                    offset = https_message_body->data_length;
                    if (offset > sizeof(mFwInfo.chunk.buf) - mFwInfo.chunk.sz)
                        offset = sizeof(mFwInfo.chunk.buf) - mFwInfo.chunk.sz;
                    memcpy(&mFwInfo.chunk.buf[mFwInfo.chunk.sz], https_message_body->data, offset);
                    mFwInfo.chunk.sz += offset;

                    /* find end of boundary */
                    msg = memmem(mFwInfo.chunk.buf, mFwInfo.chunk.sz,
                        mFwInfo.boundary, strlen(mFwInfo.boundary));
                    if (msg != NULL) {
                        /* found end of stream */
                        msg -= 2; /* backup \r\n */
                        mFwInfo.chunk.sz = (size_t)msg - (size_t)mFwInfo.chunk.buf;

                        /* sent last chunk */
                        xTaskNotifyGive(fw_update_task_handle);
                        ulTaskNotifyTake(pdTRUE, portMAX_DELAY);
                        mFwInfo.state = FW_STATE_FIRMWARE_DONE;
                    }
                    else {
                        if (mFwInfo.chunk.sz == sizeof(mFwInfo.chunk.buf)) {
                            xTaskNotifyGive(fw_update_task_handle);
                            ulTaskNotifyTake(pdTRUE, portMAX_DELAY);
                            mFwInfo.chunk.sz = 0;
                        }
                        else {
                            break; /* keep reading data */
                        }
                    }

                    /* copy remainder */
                    do {
                        mFwInfo.chunk.sz = https_message_body->data_length - offset;
                        if (mFwInfo.chunk.sz > sizeof(mFwInfo.chunk.buf))
                            mFwInfo.chunk.sz = sizeof(mFwInfo.chunk.buf);
                        memcpy(mFwInfo.chunk.buf, &https_message_body->data[offset], mFwInfo.chunk.sz);
                        offset += mFwInfo.chunk.sz;
                        if (mFwInfo.chunk.sz == sizeof(mFwInfo.chunk.buf)) {
                            xTaskNotifyGive(fw_update_task_handle);
                            ulTaskNotifyTake(pdTRUE, portMAX_DELAY);
                            mFwInfo.chunk.sz = 0;
                        }
                        else {
                            /* leave remainder */
                            break;
                        }
                    } while (offset < https_message_body->data_length);

