wolfSSL/wolftpm-examples/Infineon/PSoC6_WiFi_HTTPS_Server/source/secure_http_server.c
                    if (mFwInfo.state != FW_STATE_FIRMWARE_DONE) {
                        break;
                    }
                    /* fall-through */

                case FW_STATE_FIRMWARE_DONE:
                    printf("Firmware data received: %d bytes\n", mFwInfo.firmwareSz);
                    /* send last 0 byte chunk to finalize */
                    mFwInfo.chunk.sz = 0;
                    xTaskNotifyGive(fw_update_task_handle);
                    ulTaskNotifyTake(pdTRUE, portMAX_DELAY);

                    /* wait for task to complete */
                    while (mFwInfo.threadState != FW_STATE_THREAD_DONE &&
                           mFwInfo.threadState != FW_STATE_THREAD_FAILED) {
                        vTaskDelay(1);
                    }
                    if (mFwInfo.threadRc != 0) {
                        break;
                    }
                    mFwInfo.state = FW_STATE_FIRMWARE_REST;
                    /* fall-through */
                case FW_STATE_FIRMWARE_REST:
                    cyhal_gpio_write(CYBSP_USER_LED2, CYBSP_LED_STATE_OFF);
                    cyhal_gpio_write(CYBSP_LED_RGB_GREEN, CYBSP_LED_STATE_ON);

                    printf("Reset device\n");
                    break;
            }

            if (https_message_body->data_remaining == 0) {
                /* Send the HTTPS response. */
                msg = HTTPS_STARTUP_HEADER;
                result = cy_http_server_response_stream_write_payload(stream,
                    msg, strlen(msg));
                if (CY_RSLT_SUCCESS == result) {
                    if (strlen(err_buf) == 0) {
                        snprintf(err_buf, sizeof(err_buf),
                            "Update result 0x%x: %s",
                            mFwInfo.threadRc, TPM2_GetRCString(mFwInfo.threadRc));
                    }
                    msg = err_buf;
                    result = cy_http_server_response_stream_write_payload(stream,
                        msg, strlen(msg));
                }
                if (CY_RSLT_SUCCESS == result) {
                    msg = HTTPS_STARTUP_FOOTER;
                    result = cy_http_server_response_stream_write_payload(stream,
                        msg, strlen(msg));
                }
                if (CY_RSLT_SUCCESS != result) {
                    ERR_INFO(("Failed to send the HTTPS POST response.\n"));
                }

                mFwInfo.state = FW_STATE_INIT; /* reset state */
            }
            break;

        case CY_HTTP_REQUEST_PUT:

            /* Send the HTTPS error response. */
            const char* putErrStr = "HTTP PUT not supported";
            result = cy_http_server_response_stream_write_payload(stream,
                putErrStr, strlen(putErrStr));
            status = HTTPS_REQUEST_HANDLE_ERROR;
            if (CY_RSLT_SUCCESS != result)
            {
                ERR_INFO(("Failed to send the HTTPS PUT error response.\n"));
            }
            break;

        default:
            ERR_INFO(("Received invalid HTTP request method. Supported HTTP methods are GET, POST, and PUT.\n"));
            break;
    }

    if (CY_RSLT_SUCCESS != result)
    {
        status = HTTPS_REQUEST_HANDLE_ERROR;
    }

    print_heap_usage("At the end of GET/POST/PUT request handler");
    cyhal_gpio_write(CYBSP_USER_LED, CYBSP_LED_STATE_OFF);

    return status;
}

/*******************************************************************************
 * Function Name: https_put_resource_handler
 *******************************************************************************
 * Summary:
 *  Handles HTTPS GET request for the newly created resource by the client
 *  through HTTPS PUT request. It returns the value registered with the requested
 *  resource.
 *
 * Parameters:
 *  url_path - Pointer to the HTTPS URL path.
 *  url_parameters - Pointer to the HTTPS URL query string.
 *  stream - Pointer to the HTTPS response stream.
 *  arg - Pointer to the argument passed during HTTPS resource registration.
 *  https_message_body - Pointer to the HTTPS data from the client.
 *
 * Return:
 *  int32_t - Returns HTTPS_REQUEST_HANDLE_SUCCESS if the request from the client
 *  was handled successfully. Otherwise, it returns HTTPS_REQUEST_HANDLE_ERROR.
 *
 *******************************************************************************/
int32_t https_put_resource_handler(const char *url_path,
                                   const char *url_parameters,
                                   cy_http_response_stream_t *stream,
                                   void *arg,
                                   cy_http_message_body_t *https_message_body)
{
    cy_rslt_t result = CY_RSLT_SUCCESS;
    int32_t status = HTTPS_REQUEST_HANDLE_SUCCESS;
    uint32_t index = 0;

    if (CY_HTTP_REQUEST_GET == https_message_body->request_type)
    {
        APP_INFO(("Received HTTPS GET request.\n"));

        while (index < MAX_NUMBER_OF_HTTP_SERVER_RESOURCES)
        {
            if (strcmp(url_resources_db[index].resource_name, (char *)arg) == 0)
            {
                result = cy_http_server_response_stream_write_payload(stream,
                                               url_resources_db[index].value,
                                             url_resources_db[index].length);
                break;
            }

            /* Get next entry. */
            index++;
        }
    }

    if (CY_RSLT_SUCCESS != result)
    {
        ERR_INFO(("Failed to send the response message.\n"));
        status = HTTPS_REQUEST_HANDLE_ERROR;
    }

    return status;
}

/*******************************************************************************
 * Function Name: register_https_resource
 *******************************************************************************
 * Summary:
 *  Registers/Updates the new resource with the HTTPS server when HTTPS PUT
 *  request is received from the client.
 *
 * Parameters:
 *  register_resource_name: Pointer to the resource name to be registered
 *   with the HTTPS server.
 *
 * Return:
 *  None
 *
 *******************************************************************************/
void register_https_resource(char *register_resource_name)
{
    cy_rslt_t result = CY_RSLT_SUCCESS;
    char *url_resource_data = NULL;
    uint32_t index = 0;

    APP_INFO(("New resource to create: %s\n", register_resource_name));

