wolfSSL/wolftpm-examples/Infineon/PSoC6_WiFi_HTTPS_Server/source/secure_http_server.c
    /* Configure dynamic resource handler. */
    https_put_resource.resource_handler = https_put_resource_handler;
    https_put_resource.arg = NULL;

    /* Split the URL resource name and data from the HTTPS PUT request. */
    strtok_r(register_resource_name, "=", &url_resource_data);
    APP_INFO(("New URL: %s, Response text: %s\n", register_resource_name, url_resource_data));

    /* Register the resource if it does not exist in the URL database or
     * update the resource data if the requested resource already
     * exists in the URL database.
     */
    while (index < MAX_NUMBER_OF_HTTP_SERVER_RESOURCES)
    {
        if ((NULL != url_resources_db[index].resource_name) &&
             strcmp(url_resources_db[index].resource_name, register_resource_name) == 0)
        {
            APP_INFO(("Updating the existing resource: %s\n\n", register_resource_name));
            url_resources_db[index].length = strlen(url_resource_data);
            url_resources_db[index].value = (char *)realloc(url_resources_db[index].value, (url_resources_db[index].length + 1));
            memset(url_resources_db[index].value, 0, (url_resources_db[index].length + 1));
            memcpy(url_resources_db[index].value, url_resource_data, url_resources_db[index].length);
            https_put_resource.arg = url_resources_db[index].resource_name;
            break;
        }
        else if (NULL == url_resources_db[index].resource_name)
        {
            APP_INFO(("Registering the new resource: %s\n\n", register_resource_name));
            url_resources_db[index].value = (char *)calloc(strlen(url_resource_data), sizeof(char));
            url_resources_db[index].resource_name = (char *)calloc(strlen(register_resource_name), sizeof(char));

            if ((NULL == url_resources_db[index].resource_name) ||
                (NULL == url_resources_db[index].value))
            {
                 ERR_INFO(("Failed to allocate memory for URL resources.\n"));
                 CY_ASSERT(0);
            }

            /* Add the resource name, data, and data length into URL database. */
            url_resources_db[index].length = strlen(url_resource_data);
            memcpy(url_resources_db[index].resource_name, register_resource_name,
                                                 strlen(register_resource_name));
            memcpy(url_resources_db[index].value, url_resource_data,
                                                 url_resources_db[index].length);
            https_put_resource.arg = url_resources_db[index].resource_name;

            /* Register the new/updated resource with HTTPS server. */
            result = cy_http_server_register_resource(https_server,
                                                      (uint8_t*)url_resources_db[index].resource_name,
                                                      (uint8_t*)"text/html",
                                                      CY_DYNAMIC_URL_CONTENT,
                                                      &https_put_resource);
            PRINT_AND_ASSERT(result, "Failed to register a new resource.\n");

            /* Update the resource count. */
            number_of_resources_registered++;
            break;
        }
        else
        {
            /* Get next resource. */
            index++;
        }
    }

    if (index >= MAX_NUMBER_OF_HTTP_SERVER_RESOURCES)
    {
        ERR_INFO(("Requested resource not registered/updated. Reached Maximum "
                  "allowed number of resource registration: %d\n", MAX_NUMBER_OF_HTTP_SERVER_RESOURCES));
    }

    /* Clear the request buffer. */
    //memset(resource_name, 0, sizeof(resource_name));
}

/*******************************************************************************
 * Function Name: configure_https_server
 *******************************************************************************
 * Summary:
 *  Configures the security parameters such as server certificate, private key,
 *  and the root CA certificate to start the HTTP server in secure mode. By default,
 *  it registers a dynamic URL handler to handle the HTTPS GET, POST, and PUT
 *  requests.
 *
 * Parameters:
 *  void
 *
 * Return:
 *  cy_rslt_t: Returns CY_RSLT_SUCCESS if the secure HTTP server is configured
 *  successfully, otherwise, it returns CY_RSLT_TYPE_ERROR.
 *
 *******************************************************************************/
static cy_rslt_t configure_https_server(void)
{
    cy_rslt_t result = CY_RSLT_SUCCESS;

#ifdef HTTPS_PORT
    /*
     * Setup the necessary security configuration required for establishing
     * secure HTTP connection with the secure HTTP client. This example uses
     * a self-signed certificate and is not trusted by the browser. Browsers
     * trust only the certificates signed by a CA (certificate authority).
     * To make the browser trust the connection with this HTTP server, user
     * needs to load the server certificate into the browser.
     */
    security_config.certificate                = (uint8_t *)keySERVER_CERTIFICATE_PEM;
    security_config.certificate_length         = strlen(keySERVER_CERTIFICATE_PEM);
    security_config.private_key                = (uint8_t *)keySERVER_PRIVATE_KEY_PEM;
    security_config.key_length                 = strlen(keySERVER_PRIVATE_KEY_PEM);
    security_config.root_ca_certificate        = NULL; //(uint8_t *)keyCLIENT_ROOTCA_PEM;
    security_config.root_ca_certificate_length = 0; //strlen(keyCLIENT_ROOTCA_PEM);
#endif

    /* IP address of server. */
    https_ip_address.ip_address.ip.v4 = ip_addr.ip.v4;
    https_ip_address.ip_address.version = CY_SOCKET_IP_VER_V4;

    /* Add IP address information to network interface object. */
    nw_interface.object  = (void *) &https_ip_address;
    nw_interface.type = CY_NW_INF_TYPE_WIFI;

    /* Initialize secure socket library. */
    result = cy_http_server_network_init();

    /* Allocate memory needed for secure HTTP server. */
#ifdef HTTPS_PORT
    result = cy_http_server_create(&nw_interface, HTTPS_PORT, MAX_SOCKETS, &security_config, &https_server);
#else
    result = cy_http_server_create(&nw_interface, HTTP_PORT, MAX_SOCKETS, NULL, &https_server);
#endif
    PRINT_AND_ASSERT(result, "Failed to allocate memory for the HTTPS server.\n");

